Masmiseim36/nxpSDK/devices/MIMXRT1186/cmsis_drivers/fsl_lpspi_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi7_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI7_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI7_InterruptDriverState = {
#endif
    &LPSPI7_Resource,
    &LPSPI7_Handle,
};

static int32_t LPSPI7_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI7_PIN_INIT
    RTE_SPI7_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptUninitialize(void)
{
#ifdef RTE_SPI7_PIN_DEINIT
    RTE_SPI7_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI7_InterruptDriverState);
}

static uint32_t LPSPI7_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI7_InterruptDriverState);
}

static int32_t LPSPI7_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI7_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI7_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI7_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI7 = {
    LPSPIx_GetVersion,     LPSPIx_GetCapabilities,
#if defined(RTE_SPI7_DMA_EN) && RTE_SPI7_DMA_EN
    LPSPI7_EdmaInitialize, LPSPI7_EdmaUninitialize, LPSPI7_EdmaPowerControl, LPSPI7_EdmaSend,     LPSPI7_EdmaReceive,
    LPSPI7_EdmaTransfer,   LPSPI7_EdmaGetCount,     LPSPI7_EdmaControl,      LPSPI7_EdmaGetStatus
#else
    LPSPI7_InterruptInitialize, LPSPI7_InterruptUninitialize, LPSPI7_InterruptPowerControl, LPSPI7_InterruptSend,
    LPSPI7_InterruptReceive,    LPSPI7_InterruptTransfer,     LPSPI7_InterruptGetCount,     LPSPI7_InterruptControl,
    LPSPI7_InterruptGetStatus
#endif
};

#endif /*  LPSPI7  */

#if (defined(LPSPI8) || defined(LPSPI_8)) && defined(RTE_SPI8) && RTE_SPI8

/* User needs to provide the implementation for LPSPI8_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI8_GetFreq(void);

#if defined(LPSPI8)
static cmsis_lpspi_resource_t LPSPI8_Resource = {LPSPI8, 8, LPSPI8_GetFreq};
#elif defined(LPSPI_8)
static cmsis_lpspi_resource_t LPSPI8_Resource = {LPSPI_8, 8, LPSPI8_GetFreq};
#endif

#if defined(RTE_SPI8_DMA_EN) && RTE_SPI8_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI8_EdmaResource = {
    RTE_SPI8_DMA_TX_DMA_BASE,    RTE_SPI8_DMA_TX_CH,          (uint16_t)RTE_SPI8_DMA_TX_PERI_SEL,
    RTE_SPI8_DMA_RX_DMA_BASE,    RTE_SPI8_DMA_RX_CH,          (uint16_t)RTE_SPI8_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI8_DMA_TX_DMAMUX_BASE, RTE_SPI8_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI8_EdmaHandle);
static edma_handle_t LPSPI8_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI8_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi8_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI8_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI8_EdmaDriverState = {
#endif
    &LPSPI8_Resource,
    &LPSPI8_EdmaResource,
    &LPSPI8_EdmaHandle,
    &LPSPI8_EdmaRxRegToRxDataHandle,
    &LPSPI8_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI8_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI8_PIN_INIT
    RTE_SPI8_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaUninitialize(void)
{
#ifdef RTE_SPI8_PIN_DEINIT
    RTE_SPI8_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI8_EdmaDriverState);
}

static uint32_t LPSPI8_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI8_EdmaDriverState);
}

static int32_t LPSPI8_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI8_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI8_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI8_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI8_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi8_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI8_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI8_InterruptDriverState = {
#endif
    &LPSPI8_Resource,
    &LPSPI8_Handle,
};

static int32_t LPSPI8_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI8_PIN_INIT
    RTE_SPI8_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptUninitialize(void)
{
#ifdef RTE_SPI8_PIN_DEINIT
    RTE_SPI8_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI8_InterruptDriverState);
}

static uint32_t LPSPI8_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI8_InterruptDriverState);
}

static int32_t LPSPI8_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI8_InterruptDriverState);
}

