Masmiseim36/nxpSDK/devices/MIMXRT1186/cmsis_drivers/fsl_lpspi_cmsis.c
static int32_t LPSPI18_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI18_EdmaDriverState);
}

static int32_t LPSPI18_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI18_EdmaDriverState);
}

static int32_t LPSPI18_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI18_EdmaDriverState);
}

static int32_t LPSPI18_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI18_EdmaDriverState);
}

static uint32_t LPSPI18_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI18_EdmaDriverState);
}

static int32_t LPSPI18_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPSPI_EdmaControl(control, arg, &LPSPI18_EdmaDriverState);
}

static ARM_SPI_STATUS LPSPI18_EdmaGetStatus(void)
{
    return LPSPI_EdmaGetStatus(&LPSPI18_EdmaDriverState);
}

#endif

#else

static cmsis_lpspi_handle_t LPSPI18_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi18_interrupt_driver_state")
static cmsis_lpspi_interrupt_driver_state_t LPSPI18_InterruptDriverState = {
#else
static cmsis_lpspi_interrupt_driver_state_t LPSPI18_InterruptDriverState = {
#endif
    &LPSPI18_Resource,
    &LPSPI18_Handle,
};

static int32_t LPSPI18_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI18_PIN_INIT
    RTE_SPI18_PIN_INIT();
#endif
    return LPSPI_InterruptInitialize(cb_event, &LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptUninitialize(void)
{
#ifdef RTE_SPI18_PIN_DEINIT
    RTE_SPI18_PIN_DEINIT();
#endif
    return LPSPI_InterruptUninitialize(&LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_InterruptPowerControl(state, &LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptSend(const void *data, uint32_t num)
{
    return LPSPI_InterruptSend(data, num, &LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptReceive(void *data, uint32_t num)
{
    return LPSPI_InterruptReceive(data, num, &LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_InterruptTransfer(data_out, data_in, num, &LPSPI18_InterruptDriverState);
}

static uint32_t LPSPI18_InterruptGetCount(void)
{
    return LPSPI_InterruptGetCount(&LPSPI18_InterruptDriverState);
}

static int32_t LPSPI18_InterruptControl(uint32_t control, uint32_t arg)
{
    return LPSPI_InterruptControl(control, arg, &LPSPI18_InterruptDriverState);
}

static ARM_SPI_STATUS LPSPI18_InterruptGetStatus(void)
{
    return LPSPI_InterruptGetStatus(&LPSPI18_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI18 = {
    LPSPIx_GetVersion,      LPSPIx_GetCapabilities,
#if defined(RTE_SPI18_DMA_EN) && RTE_SPI18_DMA_EN
    LPSPI18_EdmaInitialize, LPSPI18_EdmaUninitialize, LPSPI18_EdmaPowerControl, LPSPI18_EdmaSend,
    LPSPI18_EdmaReceive,    LPSPI18_EdmaTransfer,     LPSPI18_EdmaGetCount,     LPSPI18_EdmaControl,
    LPSPI18_EdmaGetStatus
#else
    LPSPI18_InterruptInitialize, LPSPI18_InterruptUninitialize, LPSPI18_InterruptPowerControl, LPSPI18_InterruptSend,
    LPSPI18_InterruptReceive,    LPSPI18_InterruptTransfer,     LPSPI18_InterruptGetCount,     LPSPI18_InterruptControl,
    LPSPI18_InterruptGetStatus
#endif
};

#endif /*  LPSPI18  */

#if (defined(LPSPI19) || defined(LPSPI_19)) && defined(RTE_SPI19) && RTE_SPI19

/* User needs to provide the implementation for LPSPI19_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPSPI19_GetFreq(void);

#if defined(LPSPI19)
static cmsis_lpspi_resource_t LPSPI19_Resource = {LPSPI19, 19, LPSPI19_GetFreq};
#elif defined(LPSPI_19)
static cmsis_lpspi_resource_t LPSPI19_Resource = {LPSPI_19, 19, LPSPI19_GetFreq};
#endif

#if defined(RTE_SPI19_DMA_EN) && RTE_SPI19_DMA_EN

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
static cmsis_lpspi_edma_resource_t LPSPI19_EdmaResource = {
    RTE_SPI19_DMA_TX_DMA_BASE,    RTE_SPI19_DMA_TX_CH,          (uint16_t)RTE_SPI19_DMA_TX_PERI_SEL,
    RTE_SPI19_DMA_RX_DMA_BASE,    RTE_SPI19_DMA_RX_CH,          (uint16_t)RTE_SPI19_DMA_RX_PERI_SEL,
#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_SPI19_DMA_TX_DMAMUX_BASE, RTE_SPI19_DMA_RX_DMAMUX_BASE,
#endif
};

AT_NONCACHEABLE_SECTION(static cmsis_lpspi_edma_handle_t LPSPI19_EdmaHandle);
static edma_handle_t LPSPI19_EdmaTxDataToTxRegHandle;
static edma_handle_t LPSPI19_EdmaRxRegToRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpspi19_edma_driver_state")
static cmsis_lpspi_edma_driver_state_t LPSPI19_EdmaDriverState = {
#else
static cmsis_lpspi_edma_driver_state_t LPSPI19_EdmaDriverState = {
#endif
    &LPSPI19_Resource,
    &LPSPI19_EdmaResource,
    &LPSPI19_EdmaHandle,
    &LPSPI19_EdmaRxRegToRxDataHandle,
    &LPSPI19_EdmaTxDataToTxRegHandle,
};

static int32_t LPSPI19_EdmaInitialize(ARM_SPI_SignalEvent_t cb_event)
{
#ifdef RTE_SPI19_PIN_INIT
    RTE_SPI19_PIN_INIT();
#endif
    return LPSPI_EdmaInitialize(cb_event, &LPSPI19_EdmaDriverState);
}

static int32_t LPSPI19_EdmaUninitialize(void)
{
#ifdef RTE_SPI19_PIN_DEINIT
    RTE_SPI19_PIN_DEINIT();
#endif
    return LPSPI_EdmaUninitialize(&LPSPI19_EdmaDriverState);
}

static int32_t LPSPI19_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPSPI_EdmaPowerControl(state, &LPSPI19_EdmaDriverState);
}

static int32_t LPSPI19_EdmaSend(const void *data, uint32_t num)
{
    return LPSPI_EdmaSend(data, num, &LPSPI19_EdmaDriverState);
}

static int32_t LPSPI19_EdmaReceive(void *data, uint32_t num)
{
    return LPSPI_EdmaReceive(data, num, &LPSPI19_EdmaDriverState);
}

static int32_t LPSPI19_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPSPI_EdmaTransfer(data_out, data_in, num, &LPSPI19_EdmaDriverState);
}

static uint32_t LPSPI19_EdmaGetCount(void)
{
    return LPSPI_EdmaGetCount(&LPSPI19_EdmaDriverState);
}

